---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.ClearLayerModifiers
source: html/796e264b-bd61-2e89-4cf1-684d2408e348.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.ClearLayerModifiers Method

Clears all the project layer modifiers stored in the layer info.

## Syntax (C#)
```csharp
public void ClearLayerModifiers()
```